bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
/**
  ******************************************************************************
  * @file    cam_reg.h
  * @version V1.2
  * @date    2020-03-30
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __CAM_REG_H__
#define __CAM_REG_H__

#include "bl702l.h"

/* 0x0 : dvp2axi_configue */
#define CAM_DVP2AXI_CONFIGUE_OFFSET (0x0)
#define CAM_REG_DVP_ENABLE          CAM_REG_DVP_ENABLE
#define CAM_REG_DVP_ENABLE_POS      (0U)
#define CAM_REG_DVP_ENABLE_LEN      (1U)
#define CAM_REG_DVP_ENABLE_MSK      (((1U << CAM_REG_DVP_ENABLE_LEN) - 1) << CAM_REG_DVP_ENABLE_POS)
#define CAM_REG_DVP_ENABLE_UMSK     (~(((1U << CAM_REG_DVP_ENABLE_LEN) - 1) << CAM_REG_DVP_ENABLE_POS))
#define CAM_REG_SW_MODE             CAM_REG_SW_MODE
#define CAM_REG_SW_MODE_POS         (1U)
#define CAM_REG_SW_MODE_LEN         (1U)
#define CAM_REG_SW_MODE_MSK         (((1U << CAM_REG_SW_MODE_LEN) - 1) << CAM_REG_SW_MODE_POS)
#define CAM_REG_SW_MODE_UMSK        (~(((1U << CAM_REG_SW_MODE_LEN) - 1) << CAM_REG_SW_MODE_POS))
#define CAM_REG_FRAM_VLD_POL        CAM_REG_FRAM_VLD_POL
#define CAM_REG_FRAM_VLD_POL_POS    (2U)
#define CAM_REG_FRAM_VLD_POL_LEN    (1U)
#define CAM_REG_FRAM_VLD_POL_MSK    (((1U << CAM_REG_FRAM_VLD_POL_LEN) - 1) << CAM_REG_FRAM_VLD_POL_POS)
#define CAM_REG_FRAM_VLD_POL_UMSK   (~(((1U << CAM_REG_FRAM_VLD_POL_LEN) - 1) << CAM_REG_FRAM_VLD_POL_POS))
#define CAM_REG_LINE_VLD_POL        CAM_REG_LINE_VLD_POL
#define CAM_REG_LINE_VLD_POL_POS    (3U)
#define CAM_REG_LINE_VLD_POL_LEN    (1U)
#define CAM_REG_LINE_VLD_POL_MSK    (((1U << CAM_REG_LINE_VLD_POL_LEN) - 1) << CAM_REG_LINE_VLD_POL_POS)
#define CAM_REG_LINE_VLD_POL_UMSK   (~(((1U << CAM_REG_LINE_VLD_POL_LEN) - 1) << CAM_REG_LINE_VLD_POL_POS))
#define CAM_REG_HBURST              CAM_REG_HBURST
#define CAM_REG_HBURST_POS          (4U)
#define CAM_REG_HBURST_LEN          (2U)
#define CAM_REG_HBURST_MSK          (((1U << CAM_REG_HBURST_LEN) - 1) << CAM_REG_HBURST_POS)
#define CAM_REG_HBURST_UMSK         (~(((1U << CAM_REG_HBURST_LEN) - 1) << CAM_REG_HBURST_POS))
#define CAM_REG_DVP_MODE            CAM_REG_DVP_MODE
#define CAM_REG_DVP_MODE_POS        (8U)
#define CAM_REG_DVP_MODE_LEN        (3U)
#define CAM_REG_DVP_MODE_MSK        (((1U << CAM_REG_DVP_MODE_LEN) - 1) << CAM_REG_DVP_MODE_POS)
#define CAM_REG_DVP_MODE_UMSK       (~(((1U << CAM_REG_DVP_MODE_LEN) - 1) << CAM_REG_DVP_MODE_POS))
#define CAM_REG_HW_MODE_FWRAP       CAM_REG_HW_MODE_FWRAP
#define CAM_REG_HW_MODE_FWRAP_POS   (11U)
#define CAM_REG_HW_MODE_FWRAP_LEN   (1U)
#define CAM_REG_HW_MODE_FWRAP_MSK   (((1U << CAM_REG_HW_MODE_FWRAP_LEN) - 1) << CAM_REG_HW_MODE_FWRAP_POS)
#define CAM_REG_HW_MODE_FWRAP_UMSK  (~(((1U << CAM_REG_HW_MODE_FWRAP_LEN) - 1) << CAM_REG_HW_MODE_FWRAP_POS))
#define CAM_REG_DROP_EN             CAM_REG_DROP_EN
#define CAM_REG_DROP_EN_POS         (12U)
#define CAM_REG_DROP_EN_LEN         (1U)
#define CAM_REG_DROP_EN_MSK         (((1U << CAM_REG_DROP_EN_LEN) - 1) << CAM_REG_DROP_EN_POS)
#define CAM_REG_DROP_EN_UMSK        (~(((1U << CAM_REG_DROP_EN_LEN) - 1) << CAM_REG_DROP_EN_POS))
#define CAM_REG_DROP_EVEN           CAM_REG_DROP_EVEN
#define CAM_REG_DROP_EVEN_POS       (13U)
#define CAM_REG_DROP_EVEN_LEN       (1U)
#define CAM_REG_DROP_EVEN_MSK       (((1U << CAM_REG_DROP_EVEN_LEN) - 1) << CAM_REG_DROP_EVEN_POS)
#define CAM_REG_DROP_EVEN_UMSK      (~(((1U << CAM_REG_DROP_EVEN_LEN) - 1) << CAM_REG_DROP_EVEN_POS))
#define CAM_REG_SUBSAMPLE_EN        CAM_REG_SUBSAMPLE_EN
#define CAM_REG_SUBSAMPLE_EN_POS    (14U)
#define CAM_REG_SUBSAMPLE_EN_LEN    (1U)
#define CAM_REG_SUBSAMPLE_EN_MSK    (((1U << CAM_REG_SUBSAMPLE_EN_LEN) - 1) << CAM_REG_SUBSAMPLE_EN_POS)
#define CAM_REG_SUBSAMPLE_EN_UMSK   (~(((1U << CAM_REG_SUBSAMPLE_EN_LEN) - 1) << CAM_REG_SUBSAMPLE_EN_POS))
#define CAM_REG_SUBSAMPLE_EVEN      CAM_REG_SUBSAMPLE_EVEN
#define CAM_REG_SUBSAMPLE_EVEN_POS  (15U)
#define CAM_REG_SUBSAMPLE_EVEN_LEN  (1U)
#define CAM_REG_SUBSAMPLE_EVEN_MSK  (((1U << CAM_REG_SUBSAMPLE_EVEN_LEN) - 1) << CAM_REG_SUBSAMPLE_EVEN_POS)
#define CAM_REG_SUBSAMPLE_EVEN_UMSK (~(((1U << CAM_REG_SUBSAMPLE_EVEN_LEN) - 1) << CAM_REG_SUBSAMPLE_EVEN_POS))
#define CAM_REG_INTERLV_MODE        CAM_REG_INTERLV_MODE
#define CAM_REG_INTERLV_MODE_POS    (16U)
#define CAM_REG_INTERLV_MODE_LEN    (1U)
#define CAM_REG_INTERLV_MODE_MSK    (((1U << CAM_REG_INTERLV_MODE_LEN) - 1) << CAM_REG_INTERLV_MODE_POS)
#define CAM_REG_INTERLV_MODE_UMSK   (~(((1U << CAM_REG_INTERLV_MODE_LEN) - 1) << CAM_REG_INTERLV_MODE_POS))
#define CAM_REG_DVP_PIX_CLK_CG      CAM_REG_DVP_PIX_CLK_CG
#define CAM_REG_DVP_PIX_CLK_CG_POS  (20U)
#define CAM_REG_DVP_PIX_CLK_CG_LEN  (1U)
#define CAM_REG_DVP_PIX_CLK_CG_MSK  (((1U << CAM_REG_DVP_PIX_CLK_CG_LEN) - 1) << CAM_REG_DVP_PIX_CLK_CG_POS)
#define CAM_REG_DVP_PIX_CLK_CG_UMSK (~(((1U << CAM_REG_DVP_PIX_CLK_CG_LEN) - 1) << CAM_REG_DVP_PIX_CLK_CG_POS))
#define CAM_REG_DVP_WAIT_CYCLE      CAM_REG_DVP_WAIT_CYCLE
#define CAM_REG_DVP_WAIT_CYCLE_POS  (24U)
#define CAM_REG_DVP_WAIT_CYCLE_LEN  (8U)
#define CAM_REG_DVP_WAIT_CYCLE_MSK  (((1U << CAM_REG_DVP_WAIT_CYCLE_LEN) - 1) << CAM_REG_DVP_WAIT_CYCLE_POS)
#define CAM_REG_DVP_WAIT_CYCLE_UMSK (~(((1U << CAM_REG_DVP_WAIT_CYCLE_LEN) - 1) << CAM_REG_DVP_WAIT_CYCLE_POS))

