bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
/* 0x4 : dvp2ahb_addr_start_0 */
#define CAM_DVP2AHB_ADDR_START_0_OFFSET (0x4)
#define CAM_REG_ADDR_START_0            CAM_REG_ADDR_START_0
#define CAM_REG_ADDR_START_0_POS        (0U)
#define CAM_REG_ADDR_START_0_LEN        (32U)
#define CAM_REG_ADDR_START_0_MSK        (((1U << CAM_REG_ADDR_START_0_LEN) - 1) << CAM_REG_ADDR_START_0_POS)
#define CAM_REG_ADDR_START_0_UMSK       (~(((1U << CAM_REG_ADDR_START_0_LEN) - 1) << CAM_REG_ADDR_START_0_POS))

/* 0x8 : dvp2ahb_mem_bcnt_0 */
#define CAM_DVP2AHB_MEM_BCNT_0_OFFSET (0x8)
#define CAM_REG_MEM_BURST_CNT_0       CAM_REG_MEM_BURST_CNT_0
#define CAM_REG_MEM_BURST_CNT_0_POS   (0U)
#define CAM_REG_MEM_BURST_CNT_0_LEN   (32U)
#define CAM_REG_MEM_BURST_CNT_0_MSK   (((1U << CAM_REG_MEM_BURST_CNT_0_LEN) - 1) << CAM_REG_MEM_BURST_CNT_0_POS)
#define CAM_REG_MEM_BURST_CNT_0_UMSK  (~(((1U << CAM_REG_MEM_BURST_CNT_0_LEN) - 1) << CAM_REG_MEM_BURST_CNT_0_POS))

/* 0xC : dvp2ahb_frame_bcnt_0 */
#define CAM_DVP2AHB_FRAME_BCNT_0_OFFSET (0xC)
#define CAM_REG_FRAME_BURST_CNT_0       CAM_REG_FRAME_BURST_CNT_0
#define CAM_REG_FRAME_BURST_CNT_0_POS   (0U)
#define CAM_REG_FRAME_BURST_CNT_0_LEN   (32U)
#define CAM_REG_FRAME_BURST_CNT_0_MSK   (((1U << CAM_REG_FRAME_BURST_CNT_0_LEN) - 1) << CAM_REG_FRAME_BURST_CNT_0_POS)
#define CAM_REG_FRAME_BURST_CNT_0_UMSK  (~(((1U << CAM_REG_FRAME_BURST_CNT_0_LEN) - 1) << CAM_REG_FRAME_BURST_CNT_0_POS))

/* 0x10 : dvp2ahb_addr_start_1 */
#define CAM_DVP2AHB_ADDR_START_1_OFFSET (0x10)
#define CAM_REG_ADDR_START_1            CAM_REG_ADDR_START_1
#define CAM_REG_ADDR_START_1_POS        (0U)
#define CAM_REG_ADDR_START_1_LEN        (32U)
#define CAM_REG_ADDR_START_1_MSK        (((1U << CAM_REG_ADDR_START_1_LEN) - 1) << CAM_REG_ADDR_START_1_POS)
#define CAM_REG_ADDR_START_1_UMSK       (~(((1U << CAM_REG_ADDR_START_1_LEN) - 1) << CAM_REG_ADDR_START_1_POS))

/* 0x14 : dvp2ahb_mem_bcnt_1 */
#define CAM_DVP2AHB_MEM_BCNT_1_OFFSET (0x14)
#define CAM_REG_MEM_BURST_CNT_1       CAM_REG_MEM_BURST_CNT_1
#define CAM_REG_MEM_BURST_CNT_1_POS   (0U)
#define CAM_REG_MEM_BURST_CNT_1_LEN   (32U)
#define CAM_REG_MEM_BURST_CNT_1_MSK   (((1U << CAM_REG_MEM_BURST_CNT_1_LEN) - 1) << CAM_REG_MEM_BURST_CNT_1_POS)
#define CAM_REG_MEM_BURST_CNT_1_UMSK  (~(((1U << CAM_REG_MEM_BURST_CNT_1_LEN) - 1) << CAM_REG_MEM_BURST_CNT_1_POS))

/* 0x18 : dvp2ahb_frame_bcnt_1 */
#define CAM_DVP2AHB_FRAME_BCNT_1_OFFSET (0x18)
#define CAM_REG_FRAME_BURST_CNT_1       CAM_REG_FRAME_BURST_CNT_1
#define CAM_REG_FRAME_BURST_CNT_1_POS   (0U)
#define CAM_REG_FRAME_BURST_CNT_1_LEN   (32U)
#define CAM_REG_FRAME_BURST_CNT_1_MSK   (((1U << CAM_REG_FRAME_BURST_CNT_1_LEN) - 1) << CAM_REG_FRAME_BURST_CNT_1_POS)
#define CAM_REG_FRAME_BURST_CNT_1_UMSK  (~(((1U << CAM_REG_FRAME_BURST_CNT_1_LEN) - 1) << CAM_REG_FRAME_BURST_CNT_1_POS))

/* 0x1C : dvp_status_and_error */
#define CAM_DVP_STATUS_AND_ERROR_OFFSET (0x1C)
#define CAM_STS_NORMAL_INT_0            CAM_STS_NORMAL_INT_0
#define CAM_STS_NORMAL_INT_0_POS        (0U)
#define CAM_STS_NORMAL_INT_0_LEN        (1U)
#define CAM_STS_NORMAL_INT_0_MSK        (((1U << CAM_STS_NORMAL_INT_0_LEN) - 1) << CAM_STS_NORMAL_INT_0_POS)
#define CAM_STS_NORMAL_INT_0_UMSK       (~(((1U << CAM_STS_NORMAL_INT_0_LEN) - 1) << CAM_STS_NORMAL_INT_0_POS))
#define CAM_STS_NORMAL_INT_1            CAM_STS_NORMAL_INT_1
#define CAM_STS_NORMAL_INT_1_POS        (1U)
#define CAM_STS_NORMAL_INT_1_LEN        (1U)
#define CAM_STS_NORMAL_INT_1_MSK        (((1U << CAM_STS_NORMAL_INT_1_LEN) - 1) << CAM_STS_NORMAL_INT_1_POS)
#define CAM_STS_NORMAL_INT_1_UMSK       (~(((1U << CAM_STS_NORMAL_INT_1_LEN) - 1) << CAM_STS_NORMAL_INT_1_POS))
#define CAM_STS_MEM_INT_0               CAM_STS_MEM_INT_0
#define CAM_STS_MEM_INT_0_POS           (2U)
#define CAM_STS_MEM_INT_0_LEN           (1U)
#define CAM_STS_MEM_INT_0_MSK           (((1U << CAM_STS_MEM_INT_0_LEN) - 1) << CAM_STS_MEM_INT_0_POS)
#define CAM_STS_MEM_INT_0_UMSK          (~(((1U << CAM_STS_MEM_INT_0_LEN) - 1) << CAM_STS_MEM_INT_0_POS))
#define CAM_STS_MEM_INT_1               CAM_STS_MEM_INT_1
#define CAM_STS_MEM_INT_1_POS           (3U)
#define CAM_STS_MEM_INT_1_LEN           (1U)
#define CAM_STS_MEM_INT_1_MSK           (((1U << CAM_STS_MEM_INT_1_LEN) - 1) << CAM_STS_MEM_INT_1_POS)
#define CAM_STS_MEM_INT_1_UMSK          (~(((1U << CAM_STS_MEM_INT_1_LEN) - 1) << CAM_STS_MEM_INT_1_POS))
#define CAM_STS_FRAME_INT_0             CAM_STS_FRAME_INT_0
#define CAM_STS_FRAME_INT_0_POS         (4U)
#define CAM_STS_FRAME_INT_0_LEN         (1U)
#define CAM_STS_FRAME_INT_0_MSK         (((1U << CAM_STS_FRAME_INT_0_LEN) - 1) << CAM_STS_FRAME_INT_0_POS)
#define CAM_STS_FRAME_INT_0_UMSK        (~(((1U << CAM_STS_FRAME_INT_0_LEN) - 1) << CAM_STS_FRAME_INT_0_POS))
#define CAM_STS_FRAME_INT_1             CAM_STS_FRAME_INT_1
#define CAM_STS_FRAME_INT_1_POS         (5U)
#define CAM_STS_FRAME_INT_1_LEN         (1U)
#define CAM_STS_FRAME_INT_1_MSK         (((1U << CAM_STS_FRAME_INT_1_LEN) - 1) << CAM_STS_FRAME_INT_1_POS)
#define CAM_STS_FRAME_INT_1_UMSK        (~(((1U << CAM_STS_FRAME_INT_1_LEN) - 1) << CAM_STS_FRAME_INT_1_POS))
#define CAM_STS_FIFO_INT_0              CAM_STS_FIFO_INT_0
#define CAM_STS_FIFO_INT_0_POS          (6U)
#define CAM_STS_FIFO_INT_0_LEN          (1U)
#define CAM_STS_FIFO_INT_0_MSK          (((1U << CAM_STS_FIFO_INT_0_LEN) - 1) << CAM_STS_FIFO_INT_0_POS)
#define CAM_STS_FIFO_INT_0_UMSK         (~(((1U << CAM_STS_FIFO_INT_0_LEN) - 1) << CAM_STS_FIFO_INT_0_POS))
#define CAM_STS_FIFO_INT_1              CAM_STS_FIFO_INT_1
#define CAM_STS_FIFO_INT_1_POS          (7U)
#define CAM_STS_FIFO_INT_1_LEN          (1U)
#define CAM_STS_FIFO_INT_1_MSK          (((1U << CAM_STS_FIFO_INT_1_LEN) - 1) << CAM_STS_FIFO_INT_1_POS)
#define CAM_STS_FIFO_INT_1_UMSK         (~(((1U << CAM_STS_FIFO_INT_1_LEN) - 1) << CAM_STS_FIFO_INT_1_POS))
#define CAM_STS_HCNT_INT                CAM_STS_HCNT_INT
#define CAM_STS_HCNT_INT_POS            (8U)
#define CAM_STS_HCNT_INT_LEN            (1U)
#define CAM_STS_HCNT_INT_MSK            (((1U << CAM_STS_HCNT_INT_LEN) - 1) << CAM_STS_HCNT_INT_POS)
#define CAM_STS_HCNT_INT_UMSK           (~(((1U << CAM_STS_HCNT_INT_LEN) - 1) << CAM_STS_HCNT_INT_POS))
#define CAM_STS_VCNT_INT                CAM_STS_VCNT_INT
#define CAM_STS_VCNT_INT_POS            (9U)
#define CAM_STS_VCNT_INT_LEN            (1U)
#define CAM_STS_VCNT_INT_MSK            (((1U << CAM_STS_VCNT_INT_LEN) - 1) << CAM_STS_VCNT_INT_POS)
#define CAM_STS_VCNT_INT_UMSK           (~(((1U << CAM_STS_VCNT_INT_LEN) - 1) << CAM_STS_VCNT_INT_POS))
#define CAM_AHB_IDLE_0                  CAM_AHB_IDLE_0
#define CAM_AHB_IDLE_0_POS              (16U)
#define CAM_AHB_IDLE_0_LEN              (1U)
#define CAM_AHB_IDLE_0_MSK              (((1U << CAM_AHB_IDLE_0_LEN) - 1) << CAM_AHB_IDLE_0_POS)
#define CAM_AHB_IDLE_0_UMSK             (~(((1U << CAM_AHB_IDLE_0_LEN) - 1) << CAM_AHB_IDLE_0_POS))
#define CAM_AHB_IDLE_1                  CAM_AHB_IDLE_1
#define CAM_AHB_IDLE_1_POS              (17U)
#define CAM_AHB_IDLE_1_LEN              (1U)
#define CAM_AHB_IDLE_1_MSK              (((1U << CAM_AHB_IDLE_1_LEN) - 1) << CAM_AHB_IDLE_1_POS)
#define CAM_AHB_IDLE_1_UMSK             (~(((1U << CAM_AHB_IDLE_1_LEN) - 1) << CAM_AHB_IDLE_1_POS))
#define CAM_ST_DVP_IDLE                 CAM_ST_DVP_IDLE
#define CAM_ST_DVP_IDLE_POS             (19U)
#define CAM_ST_DVP_IDLE_LEN             (1U)
#define CAM_ST_DVP_IDLE_MSK             (((1U << CAM_ST_DVP_IDLE_LEN) - 1) << CAM_ST_DVP_IDLE_POS)
#define CAM_ST_DVP_IDLE_UMSK            (~(((1U << CAM_ST_DVP_IDLE_LEN) - 1) << CAM_ST_DVP_IDLE_POS))
#define CAM_FRAME_VALID_CNT_0           CAM_FRAME_VALID_CNT_0
#define CAM_FRAME_VALID_CNT_0_POS       (20U)
#define CAM_FRAME_VALID_CNT_0_LEN       (4U)
#define CAM_FRAME_VALID_CNT_0_MSK       (((1U << CAM_FRAME_VALID_CNT_0_LEN) - 1) << CAM_FRAME_VALID_CNT_0_POS)
#define CAM_FRAME_VALID_CNT_0_UMSK      (~(((1U << CAM_FRAME_VALID_CNT_0_LEN) - 1) << CAM_FRAME_VALID_CNT_0_POS))
#define CAM_FRAME_VALID_CNT_1           CAM_FRAME_VALID_CNT_1
#define CAM_FRAME_VALID_CNT_1_POS       (24U)
#define CAM_FRAME_VALID_CNT_1_LEN       (4U)
#define CAM_FRAME_VALID_CNT_1_MSK       (((1U << CAM_FRAME_VALID_CNT_1_LEN) - 1) << CAM_FRAME_VALID_CNT_1_POS)
#define CAM_FRAME_VALID_CNT_1_UMSK      (~(((1U << CAM_FRAME_VALID_CNT_1_LEN) - 1) << CAM_FRAME_VALID_CNT_1_POS))
#define CAM_ST_BUS_IDLE                 CAM_ST_BUS_IDLE
#define CAM_ST_BUS_IDLE_POS             (28U)
#define CAM_ST_BUS_IDLE_LEN             (1U)
#define CAM_ST_BUS_IDLE_MSK             (((1U << CAM_ST_BUS_IDLE_LEN) - 1) << CAM_ST_BUS_IDLE_POS)
#define CAM_ST_BUS_IDLE_UMSK            (~(((1U << CAM_ST_BUS_IDLE_LEN) - 1) << CAM_ST_BUS_IDLE_POS))
#define CAM_ST_BUS_FUNC                 CAM_ST_BUS_FUNC
#define CAM_ST_BUS_FUNC_POS             (29U)
#define CAM_ST_BUS_FUNC_LEN             (1U)
#define CAM_ST_BUS_FUNC_MSK             (((1U << CAM_ST_BUS_FUNC_LEN) - 1) << CAM_ST_BUS_FUNC_POS)
#define CAM_ST_BUS_FUNC_UMSK            (~(((1U << CAM_ST_BUS_FUNC_LEN) - 1) << CAM_ST_BUS_FUNC_POS))
#define CAM_ST_BUS_WAIT                 CAM_ST_BUS_WAIT
#define CAM_ST_BUS_WAIT_POS             (30U)
#define CAM_ST_BUS_WAIT_LEN             (1U)
#define CAM_ST_BUS_WAIT_MSK             (((1U << CAM_ST_BUS_WAIT_LEN) - 1) << CAM_ST_BUS_WAIT_POS)
#define CAM_ST_BUS_WAIT_UMSK            (~(((1U << CAM_ST_BUS_WAIT_LEN) - 1) << CAM_ST_BUS_WAIT_POS))
#define CAM_ST_BUS_FLSH                 CAM_ST_BUS_FLSH
#define CAM_ST_BUS_FLSH_POS             (31U)
#define CAM_ST_BUS_FLSH_LEN             (1U)
#define CAM_ST_BUS_FLSH_MSK             (((1U << CAM_ST_BUS_FLSH_LEN) - 1) << CAM_ST_BUS_FLSH_POS)
#define CAM_ST_BUS_FLSH_UMSK            (~(((1U << CAM_ST_BUS_FLSH_LEN) - 1) << CAM_ST_BUS_FLSH_POS))

