bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
/* 0x20 : dvp_frame_fifo_pop */
#define CAM_DVP_FRAME_FIFO_POP_OFFSET (0x20)
#define CAM_RFIFO_POP_0               CAM_RFIFO_POP_0
#define CAM_RFIFO_POP_0_POS           (0U)
#define CAM_RFIFO_POP_0_LEN           (1U)
#define CAM_RFIFO_POP_0_MSK           (((1U << CAM_RFIFO_POP_0_LEN) - 1) << CAM_RFIFO_POP_0_POS)
#define CAM_RFIFO_POP_0_UMSK          (~(((1U << CAM_RFIFO_POP_0_LEN) - 1) << CAM_RFIFO_POP_0_POS))
#define CAM_RFIFO_POP_1               CAM_RFIFO_POP_1
#define CAM_RFIFO_POP_1_POS           (1U)
#define CAM_RFIFO_POP_1_LEN           (1U)
#define CAM_RFIFO_POP_1_MSK           (((1U << CAM_RFIFO_POP_1_LEN) - 1) << CAM_RFIFO_POP_1_POS)
#define CAM_RFIFO_POP_1_UMSK          (~(((1U << CAM_RFIFO_POP_1_LEN) - 1) << CAM_RFIFO_POP_1_POS))
#define CAM_REG_INT_NORMAL_CLR_0      CAM_REG_INT_NORMAL_CLR_0
#define CAM_REG_INT_NORMAL_CLR_0_POS  (4U)
#define CAM_REG_INT_NORMAL_CLR_0_LEN  (1U)
#define CAM_REG_INT_NORMAL_CLR_0_MSK  (((1U << CAM_REG_INT_NORMAL_CLR_0_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_0_POS)
#define CAM_REG_INT_NORMAL_CLR_0_UMSK (~(((1U << CAM_REG_INT_NORMAL_CLR_0_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_0_POS))
#define CAM_REG_INT_MEM_CLR_0         CAM_REG_INT_MEM_CLR_0
#define CAM_REG_INT_MEM_CLR_0_POS     (5U)
#define CAM_REG_INT_MEM_CLR_0_LEN     (1U)
#define CAM_REG_INT_MEM_CLR_0_MSK     (((1U << CAM_REG_INT_MEM_CLR_0_LEN) - 1) << CAM_REG_INT_MEM_CLR_0_POS)
#define CAM_REG_INT_MEM_CLR_0_UMSK    (~(((1U << CAM_REG_INT_MEM_CLR_0_LEN) - 1) << CAM_REG_INT_MEM_CLR_0_POS))
#define CAM_REG_INT_FRAME_CLR_0       CAM_REG_INT_FRAME_CLR_0
#define CAM_REG_INT_FRAME_CLR_0_POS   (6U)
#define CAM_REG_INT_FRAME_CLR_0_LEN   (1U)
#define CAM_REG_INT_FRAME_CLR_0_MSK   (((1U << CAM_REG_INT_FRAME_CLR_0_LEN) - 1) << CAM_REG_INT_FRAME_CLR_0_POS)
#define CAM_REG_INT_FRAME_CLR_0_UMSK  (~(((1U << CAM_REG_INT_FRAME_CLR_0_LEN) - 1) << CAM_REG_INT_FRAME_CLR_0_POS))
#define CAM_REG_INT_FIFO_CLR_0        CAM_REG_INT_FIFO_CLR_0
#define CAM_REG_INT_FIFO_CLR_0_POS    (7U)
#define CAM_REG_INT_FIFO_CLR_0_LEN    (1U)
#define CAM_REG_INT_FIFO_CLR_0_MSK    (((1U << CAM_REG_INT_FIFO_CLR_0_LEN) - 1) << CAM_REG_INT_FIFO_CLR_0_POS)
#define CAM_REG_INT_FIFO_CLR_0_UMSK   (~(((1U << CAM_REG_INT_FIFO_CLR_0_LEN) - 1) << CAM_REG_INT_FIFO_CLR_0_POS))
#define CAM_REG_INT_HCNT_CLR_0        CAM_REG_INT_HCNT_CLR_0
#define CAM_REG_INT_HCNT_CLR_0_POS    (8U)
#define CAM_REG_INT_HCNT_CLR_0_LEN    (1U)
#define CAM_REG_INT_HCNT_CLR_0_MSK    (((1U << CAM_REG_INT_HCNT_CLR_0_LEN) - 1) << CAM_REG_INT_HCNT_CLR_0_POS)
#define CAM_REG_INT_HCNT_CLR_0_UMSK   (~(((1U << CAM_REG_INT_HCNT_CLR_0_LEN) - 1) << CAM_REG_INT_HCNT_CLR_0_POS))
#define CAM_REG_INT_VCNT_CLR_0        CAM_REG_INT_VCNT_CLR_0
#define CAM_REG_INT_VCNT_CLR_0_POS    (9U)
#define CAM_REG_INT_VCNT_CLR_0_LEN    (1U)
#define CAM_REG_INT_VCNT_CLR_0_MSK    (((1U << CAM_REG_INT_VCNT_CLR_0_LEN) - 1) << CAM_REG_INT_VCNT_CLR_0_POS)
#define CAM_REG_INT_VCNT_CLR_0_UMSK   (~(((1U << CAM_REG_INT_VCNT_CLR_0_LEN) - 1) << CAM_REG_INT_VCNT_CLR_0_POS))
#define CAM_REG_INT_NORMAL_CLR_1      CAM_REG_INT_NORMAL_CLR_1
#define CAM_REG_INT_NORMAL_CLR_1_POS  (16U)
#define CAM_REG_INT_NORMAL_CLR_1_LEN  (1U)
#define CAM_REG_INT_NORMAL_CLR_1_MSK  (((1U << CAM_REG_INT_NORMAL_CLR_1_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_1_POS)
#define CAM_REG_INT_NORMAL_CLR_1_UMSK (~(((1U << CAM_REG_INT_NORMAL_CLR_1_LEN) - 1) << CAM_REG_INT_NORMAL_CLR_1_POS))
#define CAM_REG_INT_MEM_CLR_1         CAM_REG_INT_MEM_CLR_1
#define CAM_REG_INT_MEM_CLR_1_POS     (17U)
#define CAM_REG_INT_MEM_CLR_1_LEN     (1U)
#define CAM_REG_INT_MEM_CLR_1_MSK     (((1U << CAM_REG_INT_MEM_CLR_1_LEN) - 1) << CAM_REG_INT_MEM_CLR_1_POS)
#define CAM_REG_INT_MEM_CLR_1_UMSK    (~(((1U << CAM_REG_INT_MEM_CLR_1_LEN) - 1) << CAM_REG_INT_MEM_CLR_1_POS))
#define CAM_REG_INT_FRAME_CLR_1       CAM_REG_INT_FRAME_CLR_1
#define CAM_REG_INT_FRAME_CLR_1_POS   (18U)
#define CAM_REG_INT_FRAME_CLR_1_LEN   (1U)
#define CAM_REG_INT_FRAME_CLR_1_MSK   (((1U << CAM_REG_INT_FRAME_CLR_1_LEN) - 1) << CAM_REG_INT_FRAME_CLR_1_POS)
#define CAM_REG_INT_FRAME_CLR_1_UMSK  (~(((1U << CAM_REG_INT_FRAME_CLR_1_LEN) - 1) << CAM_REG_INT_FRAME_CLR_1_POS))
#define CAM_REG_INT_FIFO_CLR_1        CAM_REG_INT_FIFO_CLR_1
#define CAM_REG_INT_FIFO_CLR_1_POS    (19U)
#define CAM_REG_INT_FIFO_CLR_1_LEN    (1U)
#define CAM_REG_INT_FIFO_CLR_1_MSK    (((1U << CAM_REG_INT_FIFO_CLR_1_LEN) - 1) << CAM_REG_INT_FIFO_CLR_1_POS)
#define CAM_REG_INT_FIFO_CLR_1_UMSK   (~(((1U << CAM_REG_INT_FIFO_CLR_1_LEN) - 1) << CAM_REG_INT_FIFO_CLR_1_POS))

/* 0x24 : snsr_control */
#define CAM_SNSR_CONTROL_OFFSET (0x24)
#define CAM_REG_CAM_RST         CAM_REG_CAM_RST
#define CAM_REG_CAM_RST_POS     (0U)
#define CAM_REG_CAM_RST_LEN     (1U)
#define CAM_REG_CAM_RST_MSK     (((1U << CAM_REG_CAM_RST_LEN) - 1) << CAM_REG_CAM_RST_POS)
#define CAM_REG_CAM_RST_UMSK    (~(((1U << CAM_REG_CAM_RST_LEN) - 1) << CAM_REG_CAM_RST_POS))
#define CAM_REG_CAM_PWDN        CAM_REG_CAM_PWDN
#define CAM_REG_CAM_PWDN_POS    (1U)
#define CAM_REG_CAM_PWDN_LEN    (1U)
#define CAM_REG_CAM_PWDN_MSK    (((1U << CAM_REG_CAM_PWDN_LEN) - 1) << CAM_REG_CAM_PWDN_POS)
#define CAM_REG_CAM_PWDN_UMSK   (~(((1U << CAM_REG_CAM_PWDN_LEN) - 1) << CAM_REG_CAM_PWDN_POS))

/* 0x28 : int_control */
#define CAM_INT_CONTROL_OFFSET          (0x28)
#define CAM_REG_INT_NORMAL_0_EN         CAM_REG_INT_NORMAL_0_EN
#define CAM_REG_INT_NORMAL_0_EN_POS     (0U)
#define CAM_REG_INT_NORMAL_0_EN_LEN     (1U)
#define CAM_REG_INT_NORMAL_0_EN_MSK     (((1U << CAM_REG_INT_NORMAL_0_EN_LEN) - 1) << CAM_REG_INT_NORMAL_0_EN_POS)
#define CAM_REG_INT_NORMAL_0_EN_UMSK    (~(((1U << CAM_REG_INT_NORMAL_0_EN_LEN) - 1) << CAM_REG_INT_NORMAL_0_EN_POS))
#define CAM_REG_INT_NORMAL_1_EN         CAM_REG_INT_NORMAL_1_EN
#define CAM_REG_INT_NORMAL_1_EN_POS     (1U)
#define CAM_REG_INT_NORMAL_1_EN_LEN     (1U)
#define CAM_REG_INT_NORMAL_1_EN_MSK     (((1U << CAM_REG_INT_NORMAL_1_EN_LEN) - 1) << CAM_REG_INT_NORMAL_1_EN_POS)
#define CAM_REG_INT_NORMAL_1_EN_UMSK    (~(((1U << CAM_REG_INT_NORMAL_1_EN_LEN) - 1) << CAM_REG_INT_NORMAL_1_EN_POS))
#define CAM_REG_INT_MEM_EN              CAM_REG_INT_MEM_EN
#define CAM_REG_INT_MEM_EN_POS          (2U)
#define CAM_REG_INT_MEM_EN_LEN          (1U)
#define CAM_REG_INT_MEM_EN_MSK          (((1U << CAM_REG_INT_MEM_EN_LEN) - 1) << CAM_REG_INT_MEM_EN_POS)
#define CAM_REG_INT_MEM_EN_UMSK         (~(((1U << CAM_REG_INT_MEM_EN_LEN) - 1) << CAM_REG_INT_MEM_EN_POS))
#define CAM_REG_INT_FRAME_EN            CAM_REG_INT_FRAME_EN
#define CAM_REG_INT_FRAME_EN_POS        (3U)
#define CAM_REG_INT_FRAME_EN_LEN        (1U)
#define CAM_REG_INT_FRAME_EN_MSK        (((1U << CAM_REG_INT_FRAME_EN_LEN) - 1) << CAM_REG_INT_FRAME_EN_POS)
#define CAM_REG_INT_FRAME_EN_UMSK       (~(((1U << CAM_REG_INT_FRAME_EN_LEN) - 1) << CAM_REG_INT_FRAME_EN_POS))
#define CAM_REG_INT_FIFO_EN             CAM_REG_INT_FIFO_EN
#define CAM_REG_INT_FIFO_EN_POS         (4U)
#define CAM_REG_INT_FIFO_EN_LEN         (1U)
#define CAM_REG_INT_FIFO_EN_MSK         (((1U << CAM_REG_INT_FIFO_EN_LEN) - 1) << CAM_REG_INT_FIFO_EN_POS)
#define CAM_REG_INT_FIFO_EN_UMSK        (~(((1U << CAM_REG_INT_FIFO_EN_LEN) - 1) << CAM_REG_INT_FIFO_EN_POS))
#define CAM_REG_INT_HCNT_EN             CAM_REG_INT_HCNT_EN
#define CAM_REG_INT_HCNT_EN_POS         (5U)
#define CAM_REG_INT_HCNT_EN_LEN         (1U)
#define CAM_REG_INT_HCNT_EN_MSK         (((1U << CAM_REG_INT_HCNT_EN_LEN) - 1) << CAM_REG_INT_HCNT_EN_POS)
#define CAM_REG_INT_HCNT_EN_UMSK        (~(((1U << CAM_REG_INT_HCNT_EN_LEN) - 1) << CAM_REG_INT_HCNT_EN_POS))
#define CAM_REG_INT_VCNT_EN             CAM_REG_INT_VCNT_EN
#define CAM_REG_INT_VCNT_EN_POS         (6U)
#define CAM_REG_INT_VCNT_EN_LEN         (1U)
#define CAM_REG_INT_VCNT_EN_MSK         (((1U << CAM_REG_INT_VCNT_EN_LEN) - 1) << CAM_REG_INT_VCNT_EN_POS)
#define CAM_REG_INT_VCNT_EN_UMSK        (~(((1U << CAM_REG_INT_VCNT_EN_LEN) - 1) << CAM_REG_INT_VCNT_EN_POS))
#define CAM_REG_FRAME_CNT_TRGR_INT      CAM_REG_FRAME_CNT_TRGR_INT
#define CAM_REG_FRAME_CNT_TRGR_INT_POS  (28U)
#define CAM_REG_FRAME_CNT_TRGR_INT_LEN  (4U)
#define CAM_REG_FRAME_CNT_TRGR_INT_MSK  (((1U << CAM_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << CAM_REG_FRAME_CNT_TRGR_INT_POS)
#define CAM_REG_FRAME_CNT_TRGR_INT_UMSK (~(((1U << CAM_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << CAM_REG_FRAME_CNT_TRGR_INT_POS))

/* 0x30 : hsync_control */
#define CAM_HSYNC_CONTROL_OFFSET     (0x30)
#define CAM_REG_HSYNC_ACT_END        CAM_REG_HSYNC_ACT_END
#define CAM_REG_HSYNC_ACT_END_POS    (0U)
#define CAM_REG_HSYNC_ACT_END_LEN    (16U)
#define CAM_REG_HSYNC_ACT_END_MSK    (((1U << CAM_REG_HSYNC_ACT_END_LEN) - 1) << CAM_REG_HSYNC_ACT_END_POS)
#define CAM_REG_HSYNC_ACT_END_UMSK   (~(((1U << CAM_REG_HSYNC_ACT_END_LEN) - 1) << CAM_REG_HSYNC_ACT_END_POS))
#define CAM_REG_HSYNC_ACT_START      CAM_REG_HSYNC_ACT_START
#define CAM_REG_HSYNC_ACT_START_POS  (16U)
#define CAM_REG_HSYNC_ACT_START_LEN  (16U)
#define CAM_REG_HSYNC_ACT_START_MSK  (((1U << CAM_REG_HSYNC_ACT_START_LEN) - 1) << CAM_REG_HSYNC_ACT_START_POS)
#define CAM_REG_HSYNC_ACT_START_UMSK (~(((1U << CAM_REG_HSYNC_ACT_START_LEN) - 1) << CAM_REG_HSYNC_ACT_START_POS))

/* 0x34 : vsync_control */
#define CAM_VSYNC_CONTROL_OFFSET     (0x34)
#define CAM_REG_VSYNC_ACT_END        CAM_REG_VSYNC_ACT_END
#define CAM_REG_VSYNC_ACT_END_POS    (0U)
#define CAM_REG_VSYNC_ACT_END_LEN    (16U)
#define CAM_REG_VSYNC_ACT_END_MSK    (((1U << CAM_REG_VSYNC_ACT_END_LEN) - 1) << CAM_REG_VSYNC_ACT_END_POS)
#define CAM_REG_VSYNC_ACT_END_UMSK   (~(((1U << CAM_REG_VSYNC_ACT_END_LEN) - 1) << CAM_REG_VSYNC_ACT_END_POS))
#define CAM_REG_VSYNC_ACT_START      CAM_REG_VSYNC_ACT_START
#define CAM_REG_VSYNC_ACT_START_POS  (16U)
#define CAM_REG_VSYNC_ACT_START_LEN  (16U)
#define CAM_REG_VSYNC_ACT_START_MSK  (((1U << CAM_REG_VSYNC_ACT_START_LEN) - 1) << CAM_REG_VSYNC_ACT_START_POS)
#define CAM_REG_VSYNC_ACT_START_UMSK (~(((1U << CAM_REG_VSYNC_ACT_START_LEN) - 1) << CAM_REG_VSYNC_ACT_START_POS))

/* 0x38 : frame_size_control */
#define CAM_FRAME_SIZE_CONTROL_OFFSET (0x38)
#define CAM_REG_TOTAL_HCNT            CAM_REG_TOTAL_HCNT
#define CAM_REG_TOTAL_HCNT_POS        (0U)
#define CAM_REG_TOTAL_HCNT_LEN        (16U)
#define CAM_REG_TOTAL_HCNT_MSK        (((1U << CAM_REG_TOTAL_HCNT_LEN) - 1) << CAM_REG_TOTAL_HCNT_POS)
#define CAM_REG_TOTAL_HCNT_UMSK       (~(((1U << CAM_REG_TOTAL_HCNT_LEN) - 1) << CAM_REG_TOTAL_HCNT_POS))
#define CAM_REG_TOTAL_VCNT            CAM_REG_TOTAL_VCNT
#define CAM_REG_TOTAL_VCNT_POS        (16U)
#define CAM_REG_TOTAL_VCNT_LEN        (16U)
#define CAM_REG_TOTAL_VCNT_MSK        (((1U << CAM_REG_TOTAL_VCNT_LEN) - 1) << CAM_REG_TOTAL_VCNT_POS)
#define CAM_REG_TOTAL_VCNT_UMSK       (~(((1U << CAM_REG_TOTAL_VCNT_LEN) - 1) << CAM_REG_TOTAL_VCNT_POS))

/* 0x40 : frame_start_addr0_0 */
#define CAM_FRAME_START_ADDR0_0_OFFSET (0x40)
#define CAM_FRAME_START_ADDR_0_0       CAM_FRAME_START_ADDR_0_0
#define CAM_FRAME_START_ADDR_0_0_POS   (0U)
#define CAM_FRAME_START_ADDR_0_0_LEN   (32U)
#define CAM_FRAME_START_ADDR_0_0_MSK   (((1U << CAM_FRAME_START_ADDR_0_0_LEN) - 1) << CAM_FRAME_START_ADDR_0_0_POS)
#define CAM_FRAME_START_ADDR_0_0_UMSK  (~(((1U << CAM_FRAME_START_ADDR_0_0_LEN) - 1) << CAM_FRAME_START_ADDR_0_0_POS))

