bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
/* 0xBC : frame_byte_cnt1_7 */
#define CAM_FRAME_BYTE_CNT1_7_OFFSET (0xBC)
#define CAM_FRAME_BYTE_CNT_1_7       CAM_FRAME_BYTE_CNT_1_7
#define CAM_FRAME_BYTE_CNT_1_7_POS   (0U)
#define CAM_FRAME_BYTE_CNT_1_7_LEN   (32U)
#define CAM_FRAME_BYTE_CNT_1_7_MSK   (((1U << CAM_FRAME_BYTE_CNT_1_7_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_7_POS)
#define CAM_FRAME_BYTE_CNT_1_7_UMSK  (~(((1U << CAM_FRAME_BYTE_CNT_1_7_LEN) - 1) << CAM_FRAME_BYTE_CNT_1_7_POS))

/* 0xFF0 : dvp_debug */
#define CAM_DVP_DEBUG_OFFSET     (0xFF0)
#define CAM_REG_DVP_DBG_EN       CAM_REG_DVP_DBG_EN
#define CAM_REG_DVP_DBG_EN_POS   (0U)
#define CAM_REG_DVP_DBG_EN_LEN   (1U)
#define CAM_REG_DVP_DBG_EN_MSK   (((1U << CAM_REG_DVP_DBG_EN_LEN) - 1) << CAM_REG_DVP_DBG_EN_POS)
#define CAM_REG_DVP_DBG_EN_UMSK  (~(((1U << CAM_REG_DVP_DBG_EN_LEN) - 1) << CAM_REG_DVP_DBG_EN_POS))
#define CAM_REG_DVP_DBG_SEL      CAM_REG_DVP_DBG_SEL
#define CAM_REG_DVP_DBG_SEL_POS  (1U)
#define CAM_REG_DVP_DBG_SEL_LEN  (3U)
#define CAM_REG_DVP_DBG_SEL_MSK  (((1U << CAM_REG_DVP_DBG_SEL_LEN) - 1) << CAM_REG_DVP_DBG_SEL_POS)
#define CAM_REG_DVP_DBG_SEL_UMSK (~(((1U << CAM_REG_DVP_DBG_SEL_LEN) - 1) << CAM_REG_DVP_DBG_SEL_POS))

/* 0xFFC : dvp_dummy_reg */
#define CAM_DVP_DUMMY_REG_OFFSET (0xFFC)

struct cam_reg {
    /* 0x0 : dvp2axi_configue */
    union {
        struct
        {
            uint32_t reg_dvp_enable     : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_sw_mode        : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg_fram_vld_pol   : 1; /* [    2],        r/w,        0x1 */
            uint32_t reg_line_vld_pol   : 1; /* [    3],        r/w,        0x1 */
            uint32_t reg_hburst         : 2; /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_7       : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t reg_dvp_mode       : 3; /* [10: 8],        r/w,        0x0 */
            uint32_t reg_hw_mode_fwrap  : 1; /* [   11],        r/w,        0x1 */
            uint32_t reg_drop_en        : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_drop_even      : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg_subsample_en   : 1; /* [   14],        r/w,        0x0 */
            uint32_t reg_subsample_even : 1; /* [   15],        r/w,        0x0 */
            uint32_t reg_interlv_mode   : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19     : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t reg_dvp_pix_clk_cg : 1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_23     : 3; /* [23:21],       rsvd,        0x0 */
            uint32_t reg_dvp_wait_cycle : 8; /* [31:24],        r/w,       0x40 */
        } BF;
        uint32_t WORD;
    } dvp2axi_configue;

    /* 0x4 : dvp2ahb_addr_start_0 */
    union {
        struct
        {
            uint32_t reg_addr_start_0 : 32; /* [31: 0],        r/w, 0x80000000L */
        } BF;
        uint32_t WORD;
    } dvp2ahb_addr_start_0;

    /* 0x8 : dvp2ahb_mem_bcnt_0 */
    union {
        struct
        {
            uint32_t reg_mem_burst_cnt_0 : 32; /* [31: 0],        r/w,     0xc000 */
        } BF;
        uint32_t WORD;
    } dvp2ahb_mem_bcnt_0;

    /* 0xC : dvp2ahb_frame_bcnt_0 */
    union {
        struct
        {
            uint32_t reg_frame_burst_cnt_0 : 32; /* [31: 0],        r/w,     0xc000 */
        } BF;
        uint32_t WORD;
    } dvp2ahb_frame_bcnt_0;

    /* 0x10 : dvp2ahb_addr_start_1 */
    union {
        struct
        {
            uint32_t reg_addr_start_1 : 32; /* [31: 0],        r/w, 0x80000000L */
        } BF;
        uint32_t WORD;
    } dvp2ahb_addr_start_1;

    /* 0x14 : dvp2ahb_mem_bcnt_1 */
    union {
        struct
        {
            uint32_t reg_mem_burst_cnt_1 : 32; /* [31: 0],        r/w,     0xc000 */
        } BF;
        uint32_t WORD;
    } dvp2ahb_mem_bcnt_1;

    /* 0x18 : dvp2ahb_frame_bcnt_1 */
    union {
        struct
        {
            uint32_t reg_frame_burst_cnt_1 : 32; /* [31: 0],        r/w,     0xc000 */
        } BF;
        uint32_t WORD;
    } dvp2ahb_frame_bcnt_1;

    /* 0x1C : dvp_status_and_error */
    union {
        struct
        {
            uint32_t sts_normal_int_0  : 1; /* [    0],          r,        0x0 */
            uint32_t sts_normal_int_1  : 1; /* [    1],          r,        0x0 */
            uint32_t sts_mem_int_0     : 1; /* [    2],          r,        0x0 */
            uint32_t sts_mem_int_1     : 1; /* [    3],          r,        0x0 */
            uint32_t sts_frame_int_0   : 1; /* [    4],          r,        0x0 */
            uint32_t sts_frame_int_1   : 1; /* [    5],          r,        0x0 */
            uint32_t sts_fifo_int_0    : 1; /* [    6],          r,        0x0 */
            uint32_t sts_fifo_int_1    : 1; /* [    7],          r,        0x0 */
            uint32_t sts_hcnt_int      : 1; /* [    8],          r,        0x0 */
            uint32_t sts_vcnt_int      : 1; /* [    9],          r,        0x0 */
            uint32_t reserved_10_15    : 6; /* [15:10],       rsvd,        0x0 */
            uint32_t ahb_idle_0        : 1; /* [   16],          r,        0x1 */
            uint32_t ahb_idle_1        : 1; /* [   17],          r,        0x1 */
            uint32_t reserved_18       : 1; /* [   18],       rsvd,        0x0 */
            uint32_t st_dvp_idle       : 1; /* [   19],          r,        0x1 */
            uint32_t frame_valid_cnt_0 : 4; /* [23:20],          r,        0x0 */
            uint32_t frame_valid_cnt_1 : 4; /* [27:24],          r,        0x0 */
            uint32_t st_bus_idle       : 1; /* [   28],          r,        0x1 */
            uint32_t st_bus_func       : 1; /* [   29],          r,        0x0 */
            uint32_t st_bus_wait       : 1; /* [   30],          r,        0x0 */
            uint32_t st_bus_flsh       : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp_status_and_error;

