bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
    /* 0x20 : dvp_frame_fifo_pop */
    union {
        struct
        {
            uint32_t rfifo_pop_0          : 1;  /* [    0],        w1p,        0x0 */
            uint32_t rfifo_pop_1          : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reserved_2_3         : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t reg_int_normal_clr_0 : 1;  /* [    4],        w1p,        0x0 */
            uint32_t reg_int_mem_clr_0    : 1;  /* [    5],        w1p,        0x0 */
            uint32_t reg_int_frame_clr_0  : 1;  /* [    6],        w1p,        0x0 */
            uint32_t reg_int_fifo_clr_0   : 1;  /* [    7],        w1p,        0x0 */
            uint32_t reg_int_hcnt_clr_0   : 1;  /* [    8],        w1p,        0x0 */
            uint32_t reg_int_vcnt_clr_0   : 1;  /* [    9],        w1p,        0x0 */
            uint32_t reserved_10_15       : 6;  /* [15:10],       rsvd,        0x0 */
            uint32_t reg_int_normal_clr_1 : 1;  /* [   16],        w1p,        0x0 */
            uint32_t reg_int_mem_clr_1    : 1;  /* [   17],        w1p,        0x0 */
            uint32_t reg_int_frame_clr_1  : 1;  /* [   18],        w1p,        0x0 */
            uint32_t reg_int_fifo_clr_1   : 1;  /* [   19],        w1p,        0x0 */
            uint32_t reserved_20_31       : 12; /* [31:20],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp_frame_fifo_pop;

    /* 0x24 : snsr_control */
    union {
        struct
        {
            uint32_t reg_cam_rst   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reg_cam_pwdn  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } snsr_control;

    /* 0x28 : int_control */
    union {
        struct
        {
            uint32_t reg_int_normal_0_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_int_normal_1_en    : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_int_mem_en         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_int_frame_en       : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg_int_fifo_en        : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reg_int_hcnt_en        : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reg_int_vcnt_en        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7_27          : 21; /* [27: 7],       rsvd,        0x0 */
            uint32_t reg_frame_cnt_trgr_int : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } int_control;

    /* 0x2c  reserved */
    uint8_t RESERVED0x2c[4];

    /* 0x30 : hsync_control */
    union {
        struct
        {
            uint32_t reg_hsync_act_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reg_hsync_act_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } hsync_control;

    /* 0x34 : vsync_control */
    union {
        struct
        {
            uint32_t reg_vsync_act_end   : 16; /* [15: 0],        r/w,     0xffff */
            uint32_t reg_vsync_act_start : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } vsync_control;

    /* 0x38 : frame_size_control */
    union {
        struct
        {
            uint32_t reg_total_hcnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reg_total_vcnt : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_size_control;

    /* 0x3c  reserved */
    uint8_t RESERVED0x3c[4];

    /* 0x40 : frame_start_addr0_0 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_0;

    /* 0x44 : frame_byte_cnt0_0 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_0;

    /* 0x48 : frame_start_addr0_1 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_1;

    /* 0x4C : frame_byte_cnt0_1 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_1;

    /* 0x50 : frame_start_addr0_2 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_2;

    /* 0x54 : frame_byte_cnt0_2 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_2;

    /* 0x58 : frame_start_addr0_3 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_3;

    /* 0x5C : frame_byte_cnt0_3 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_3;

    /* 0x60 : frame_start_addr0_4 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_4;

    /* 0x64 : frame_byte_cnt0_4 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_4;

    /* 0x68 : frame_start_addr0_5 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_5;

    /* 0x6C : frame_byte_cnt0_5 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_5;

    /* 0x70 : frame_start_addr0_6 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_6;

    /* 0x74 : frame_byte_cnt0_6 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_6;

