bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/cam_reg.h
    /* 0x78 : frame_start_addr0_7 */
    union {
        struct
        {
            uint32_t frame_start_addr_0_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr0_7;

    /* 0x7C : frame_byte_cnt0_7 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_0_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt0_7;

    /* 0x80 : frame_start_addr1_0 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_0;

    /* 0x84 : frame_byte_cnt1_0 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_0;

    /* 0x88 : frame_start_addr1_1 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_1;

    /* 0x8C : frame_byte_cnt1_1 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_1;

    /* 0x90 : frame_start_addr1_2 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_2;

    /* 0x94 : frame_byte_cnt1_2 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_2;

    /* 0x98 : frame_start_addr1_3 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_3;

    /* 0x9C : frame_byte_cnt1_3 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_3;

    /* 0xA0 : frame_start_addr1_4 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_4;

    /* 0xA4 : frame_byte_cnt1_4 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_4;

    /* 0xA8 : frame_start_addr1_5 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_5;

    /* 0xAC : frame_byte_cnt1_5 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_5;

    /* 0xB0 : frame_start_addr1_6 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_6;

    /* 0xB4 : frame_byte_cnt1_6 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_6;

    /* 0xB8 : frame_start_addr1_7 */
    union {
        struct
        {
            uint32_t frame_start_addr_1_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_start_addr1_7;

    /* 0xBC : frame_byte_cnt1_7 */
    union {
        struct
        {
            uint32_t frame_byte_cnt_1_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } frame_byte_cnt1_7;

    /* 0xc0  reserved */
    uint8_t RESERVED0xc0[3888];

    /* 0xFF0 : dvp_debug */
    union {
        struct
        {
            uint32_t reg_dvp_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_dvp_dbg_sel : 3;  /* [ 3: 1],        r/w,        0x0 */
            uint32_t reserved_4_31   : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dvp_debug;

    /* 0xff4  reserved */
    uint8_t RESERVED0xff4[8];

    /* 0xFFC : dvp_dummy_reg */
    union {
        struct
        {
            uint32_t RESERVED_31_0 : 32; /* [31: 0],       rsvd, 0xf0f0f0f0L */
        } BF;
        uint32_t WORD;
    } dvp_dummy_reg;
};

typedef volatile struct cam_reg cam_reg_t;

#endif /* __CAM_REG_H__ */
